{"version":"5","defaultTimeframe":{"from":"now-2h","to":"now"},"sections":[{"id":"da8ac377-4290-453a-b2fb-45c079dd8ca0","type":"markdown","markdown":"# Scenario 4\n\n##### In the fantastical realm of DevOpsia, a curious spell has been cast over the land, creating a namespace known as “scenario4” through an incantation of code and mystery. Within this namespace, a deployment sprang to life, adorned with annotations and labels as intricate as runes. Yet, these markings failed to reveal themselves to the all-seeing eye of Dynatrace, the kingdom’s guardian of operational insight. The court’s tech sorcerers must now weave new magic to ensure these annotations and labels are visible, restoring the balance of visibility and control in their digital dominion.\n\n##### Run this command:\n```\ncurl https://raw.githubusercontent.com/techmaniac21/kubernetesMarchMadnessScenarios/main/scenario4 | base64 -d | kubectl apply -f –\n```\n##### A new namespace called “scenario4” is created with a deployment. This deployment has annotations and labels on it. These annotations and labels are not being ingested on the process in Dynatrace. Fix the issue so annotations and labels are ingested from this deployment.\n*Hint: There are two separate issues that must be resolved for this to work.*\n##### Save screenshots of the process in Dynatrace without annotations and labels, and one with the annotations and labels. Detail the change(s) you made in Kubernetes.\n***NOTE: The deployed resources from Github are encoded. DO NOT use this encoded information, only use the information present in Kubectl.***\n***If you need to reset the lab for any reason, you can delete the namespace that is created for the lab, and re-run the command to create the scenario namespace.***\n\n\n### Deliverables:\n* The changes you made to any resources in Kubernetes (you can save full YAML files here if you would like)\n* Screenshots in Dynatrace before and after the issue is fixed"},{"id":"b3e3d3a2-c91b-4f91-a776-c6e73c237ff3","type":"markdown","markdown":"# Answer\n\nUse this markdown tile to include your answer! Feel free to add markdown tiles as you want."}]}