{"version":"5","defaultTimeframe":{"from":"now-2h","to":"now"},"sections":[{"id":"da8ac377-4290-453a-b2fb-45c079dd8ca0","type":"markdown","markdown":"# Scenario 5\n\n##### In the far-off galaxy of Devtron, the twin planets “scenario5-prod” and “scenario5-dev” have been terraformed by the interstellar colonists of Cloud Fleet Command. However, during the deployment of their habitat pods, three mysterious glitches have been detected, threatening the stability of life support systems. The colonists must now don their troubleshooting suits, armed with Dynatrace scanners and kubectl tools, to diagnose these anomalies. Their mission: to document the aberrations and formulate a strategy for remediation, ensuring the survival of their digital utopia.\n\n##### Run this command:\n```\ncurl https://raw.githubusercontent.com/techmaniac21/kubernetesMarchMadnessScenarios/main/scenario5 | base64 -d | kubectl apply -f –\n```\n##### Two new namespaces called “scenario5-prod” and “scenario5-dev” have been created. There are 3 problems with the deployed resources. Use Dynatrace and Kubectl to find the issues. Do not worry about solving the issues, simply look for the problems and document them. Document how you would solve the issue. You must show evidence of the problem using both Dynatrace and Kubectl for full points.\n\n***NOTE: The deployed resources from Github are encoded. DO NOT use this encoded information, only use the information present in Kubectl.***\n***If you need to reset the lab for any reason, you can delete the namespace that is created for the lab, and re-run the command to create the scenario namespace.***\n\n\n### Deliverables:\n* Screenshots/descriptions of the problems found in both Dynatrace and kubectl\n* A description on how the issues would be fixed (you do not need to provide kubectl commands on how to fix them)\n* BONUS: Describe the exact steps on how to fix the issues"},{"id":"b3e3d3a2-c91b-4f91-a776-c6e73c237ff3","type":"markdown","markdown":"# Answer\n\nUse this markdown tile to include your answer! Feel free to add markdown tiles as you want."}]}